const OpenAI = require("openai");
const context = require("./context");
const openai = new OpenAI({
    apiKey: `${process.env.OPEN_AI_API_KEY}`
});

exports.openaiTextRequest = async (message) => {
    const completion = await openai.chat.completions.create({
        model: "gpt-4o-mini-2024-07-18",
        messages: [{
            role: "system",
            content: "การวิเคราะห์แบบ DISC เป็นกระบวนการที่ใช้เพื่อทำความเข้าใจลักษณะพฤติกรรมและบุคลิกภาพของบุคคลตามโมเดล DISC ซึ่งแบ่งออกเป็นสี่ประเภทหลักคือ: Dominance (D) - คนประเภท D มักมีลักษณะเป็นผู้นำ ชอบควบคุมสถานการณ์ และรับผิดชอบในการตัดสินใจ พวกเขามักจะมุ่งมั่นและมีจุดมุ่งหมายที่ชัดเจนในการดำเนินงาน.Influence (I) - คนประเภท I เป็นผู้ที่มีความสนใจในการสร้างความสนุกและความมีชีวิตชีวา ชอบทำงานเป็นทีมและมีความสามารถในการสร้างความสัมพันธ์และเชื่อมโยงกับผู้คน.Steadiness (S) - คนประเภท S มีความมั่นคงและมั่นใจ ชอบงานที่มีความเป็นระเบียบและมีความสำคัญกับความเสถียรภาพ พวกเขามักจะเป็นคนใจเย็นและให้ความสำคัญกับความรู้สึกของผู้อื่น.Conscientiousness (C) - คนประเภท C เป็นคนที่มีความพิถีพิถันในการทำงาน ชอบความแม่นยำและการวิเคราะห์ข้อมูล พวกเขามักจะเน้นที่รายละเอียดและคุณภาพของงาน.การทำการวิเคราะห์แบบ DISC จะช่วยให้เราเข้าใจลักษณะทางพฤติกรรมของบุคคลในด้านต่างๆ ซึ่งสามารถนำไปใช้ในการพัฒนาทักษะการทำงานทีม การจัดการทรัพยากรบุคคล หรือการสร้างสภาพแวดล้อมทำงานที่เหมาะสมกับแต่ละบุคคลได้ดีขึ้น",
        }, {
            role: "system",
            content: "ตอบคำถามโดยอ้างอิงจากคำถามชุดนี้ นี้เท่านั้น\n" + JSON.stringify(context.dataModel),
        }, {
            role: "user",
            content: "จากคำตอบนี้ " + message + " ช่วยพิจารณาว่าฉันเป็นกลุ่มใดใน DISC Model โดยคำให้คำตอบที่โดดเด่นที่สุด 1 Model และ อยู่ในรูปแบบ JSON ตัวอย่าง โดยประกอบไปด้วย filed Model และ Description ตัวอย่างดังนี้ {\"model\":\"Dominance\",\"description\":\"คนประเภท D มักมีลักษณะเป็นผู้นำ ชอบควบคุมสถานการณ์ และรับผิดชอบในการตัดสินใจ พวกเขามักจะมุ่งมั่นและมีจุ"
        }],
    });
    return completion.choices[0].message.content;
}

exports.openaiImageRequest = async (message) => {
    const image = await openai.images.generate({
        model: "dall-e-3",
        prompt: "จาก DISC Model อยากให้สร้างรูปคนที่มีลักษณะดังนี้" + message + "โดยในภาพต้องประกอบไปด้วย รูปคน ประเภทนั้นๆอย่างเดียว",
        size: "1024x1024"
    });
    return image.data[0].url;
}